
<!DOCTYPE HTML>
<html lang="zh" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>微信小程序 · 记录</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="吴燮,">
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-chroma/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-qrcode-list/index.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-exercises/exercises.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-disqus/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-theme-api/theme-api.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="002.html" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="輸入並搜尋" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    2018
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="001.html">
            
                <a href="001.html">
            
                    
                    微信小程序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="002.html">
            
                <a href="002.html">
            
                    
                    初识区块链
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本書使用 GitBook 釋出
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >微信小程序</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x5F00;&#x59CB;">&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x5F00;&#x59CB;</h2>
<p>2018 &#x5E74;&#x5E74;&#x521D;&#xFF0C;&#x63A5;&#x5230;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A;&#x6709;&#x5173;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x7684;&#x9879;&#x76EE;&#x3002;
&#x5F53;&#x7136;&#xFF0C;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x5BF9;&#x4E8E;&#x5C0F;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x5E76;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x6982;&#x5FF5;&#xFF0C;&#x4F46;&#x4F5C;&#x4E3A; 21 &#x4E16;&#x7EAA;&#x7684;&#x9752;&#x5C11;&#x5E74;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x662F;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x662F;&#x8BF4;&#x4E0D;&#x4E0B;&#x53BB;&#x7684;&#x3002;&#x4E8E;&#x662F;&#x5C31;&#x53BB; <a href="https://mp.weixin.qq.com/" target="_blank">&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x5E73;&#x53F0;</a>&#x4E00;&#x6E38;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x5148;&#x4E0D;&#x7528;&#x987E;&#x53CA;&#xFF0C;&#x5148;&#x6CE8;&#x518C;&#x4E2A;&#x8D26;&#x53F7;&#x7559;&#x4E0B;&#x8DB3;&#x8FF9;&#x3002;&#x4E4B;&#x540E;&#x5C31;&#x6309;&#x7167;&#x6587;&#x6863;&#x987A;&#x4E00;&#x904D;&#xFF0C;&#x5F53;&#x7136;&#x662F;&#x8981;&#x5E26;&#x7740;&#x7591;&#x95EE;&#x53BB;&#x770B;&#x3002;&#x5E26;&#x7740;&#x76EE;&#x7684;&#x662F;&#x505A;&#x4E8B;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0; <code>&#x6211;&#x662F;&#x8C01;&#xFF1F;&#x6211;&#x5728;&#x54EA;&#xFF1F;&#x6211;&#x5728;&#x5E72;&#x4EC0;&#x4E48;&#xFF1F;</code> &#x8FD9;&#x6837;&#x7684;&#x7591;&#x95EE;&#x3002;</p>
<blockquote>
<p>&#x7591;&#x95EE;</p>
</blockquote>
<ul>
<li>&#x5982;&#x4F55;&#x5F00;&#x53D1;&#xFF08;&#x6D89;&#x53CA;&#x5F00;&#x53D1;&#x8BED;&#x8A00;&#xFF0C;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x3001;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#xFF09;</li>
<li>&#x5982;&#x4F55;&#x9884;&#x89C8;&#xFF08;&#x6D89;&#x53CA;&#x5F00;&#x53D1;&#x9884;&#x89C8;&#x3001;&#x8C03;&#x8BD5;&#xFF09;</li>
<li>&#x5982;&#x4F55;&#x90E8;&#x7F72;&#xFF08;&#x6700;&#x7EC8;&#x7528;&#x6237;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#xFF09;</li>
</ul>
<blockquote>
<p>&#x89E3;&#x60D1;</p>
</blockquote>
<ul>
<li>&#x5F00;&#x53D1;&#x8BED;&#x8A00; wxml wxss js, &#x5F00;&#x53D1;&#x73AF;&#x5883;&#x3001;&#x5DE5;&#x5177; &#x5FAE;&#x4FE1;&#x5F00;&#x53D1;&#x5DE5;&#x5177;</li>
<li>&#x9884;&#x89C8;&#x3001;&#x8C03;&#x8BD5; &#x901A;&#x8FC7;&#x5FAE;&#x4FE1;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x7F16;&#x8BD1;&#x6216;&#x9884;&#x89C8;&#x5728;&#x624B;&#x673A;&#x4E0A;&#x4F53;&#x9A8C;</li>
<li>&#x90E8;&#x7F72; &#x4E0A;&#x4F20;&#x4EE3;&#x7801;&#xFF0C;&#x63D0;&#x4EA4;&#x5BA1;&#x6838;&#xFF0C;&#x5BA1;&#x6838;&#x901A;&#x8FC7;&#xFF0C;&#x624B;&#x52A8;&#x53D1;&#x5E03;</li>
</ul>
<p>&#x5F53;&#x7136;&#xFF0C;&#x77E5;&#x9053;&#x4E86;&#x8FD9;&#x4E9B;&#x8FD8;&#x4E0D;&#x591F;&#xFF0C;&#x5FEB;&#x901F;&#x5B66;&#x4E60;&#x7684;&#x6700;&#x597D;&#x529E;&#x6CD5;&#x662F;&#x4E34;&#x6479;&#x3002;</p>
<p>&#x56E0;&#x4E3A; 17 &#x5E74;&#x672B;&#x7684;&#x65F6;&#x5019;&#x7ECF;&#x5E38;&#x770B; <a href="https://y.qq.com/n/yqq/singer/000rbz4D2yROaH.html#tab=song&amp;stat=y_new.album.header.singername" target="_blank">&#x8499;&#x9762;&#x5531;&#x5C06;&#x731C;&#x731C;&#x731C;</a>&#xFF0C;&#x52A0;&#x4E0A;&#x4E4B;&#x524D;&#x5B66;&#x4E60; DOM&#x64CD;&#x4F5C; &#x548C; <code>jquery</code> &#x65F6;&#x505A;&#x8FC7;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;<a href="https://somethingaboutlearn.github.io/Music/" target="_blank">&#x97F3;&#x4E50;&#x64AD;&#x653E;&#x5668;</a>&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x6765;&#x4E86;&#x5174;&#x8DA3;&#xFF0C;&#x4E34;&#x6479;&#x4E86; <a href="https://y.qq.com/m/index.html" target="_blank">QQ&#x97F3;&#x4E50;</a> &#x7684;&#x79FB;&#x52A8;&#x7AEF;&#x9875;&#x9762;&#xFF0C;&#x505A;&#x4E86;&#x4E00;&#x4E2A;&#x5C0F;&#x7A0B;&#x5E8F;&#x7248;&#x3002;&#x901A;&#x8FC7;&#x641C;&#x7D22;&#x548C;&#x5206;&#x6790; <code>QQ&#x97F3;&#x4E50;</code> &#x7F51;&#x9875;&#x7684; http &#x8BF7;&#x6C42;&#xFF0C;&#x62FF;&#x5230;&#x4E86;&#x79FB;&#x52A8;&#x7AEF;&#x8FD9;&#x51E0;&#x4E2A;&#x9875;&#x9762;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x5C0F;&#x7A0B;&#x5E8F; demo &#x5C31;&#x51FA;&#x6765;&#x4E86;&#x3002;</p>
<p>&#x8BF4;&#x8D77;&#x6765;&#x5C31;&#x51E0;&#x5206;&#x949F;&#xFF0C;&#x4F46;&#x771F;&#x6B63;&#x641E;&#x5B9A;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x5C31;&#x5230;&#x5468;&#x672B;&#x4E86;&#x3002;&#x63A5;&#x7740;&#x5C31;&#x662F;&#x7740;&#x624B;&#x5F00;&#x53D1;&#xFF0C;&#x8FB9;&#x770B;&#x6587;&#x6863;&#x8FB9;&#x5F00;&#x53D1;&#x3002;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x7684;&#x8BBE;&#x8BA1;&#x7406;&#x5FF5;&#x4E0E; vue &#x5F88;&#x76F8;&#x4F3C;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x7EC4;&#x4EF6;&#x548C; API &#x63A5;&#x53E3;&#xFF0C;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x5C31;&#x53BB;&#x627E;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x7EC4;&#x4EF6;&#x548C;&#x63A5;&#x53E3;&#xFF0C;&#x53EA;&#x9700;&#x628A;&#x7CBE;&#x529B;&#x96C6;&#x4E2D;&#x5728;&#x4E1A;&#x52A1;&#x4E0A;&#xFF0C;&#x5F00;&#x53D1;&#x5C31;&#x50CF;&#x642D;&#x79EF;&#x6728;&#x90A3;&#x6837;&#x7B80;&#x5355;&#x5FEB;&#x6377;&#x3002;</p>
<p>&#x524D;&#x9762;&#x8FD9;&#x4E9B;&#x5DE5;&#x4F5C;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x662F;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#x524D;&#x7684;&#x6280;&#x672F;&#x51C6;&#x5907;&#x8C03;&#x7814;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E4B;&#x540E;&#x5C31;&#x662F;&#x9700;&#x6C42;&#x5206;&#x6790;&#xFF0C;&#x9700;&#x6C42;&#x8BC4;&#x5BA1;&#xFF0C;&#x51FA;&#x539F;&#x578B;&#x56FE;&#xFF0C;&#x51FA; UI &#x56FE;...&#x7B49;&#x7B49;&#x3002;&#x7ECF;&#x5386;&#x8FD9;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x53CD;&#x590D;&#x534F;&#x5546;&#x540E;&#xFF0C;&#x62FF;&#x5230;&#x8BBE;&#x8BA1;&#x7A3F;&#x548C;&#x5207;&#x56FE;&#xFF0C;&#x5C31;&#x7740;&#x624B;&#x642D;&#x79EF;&#x6728;&#xFF0C;&#x54E6;&#x4E0D;&#xFF0C;&#x7740;&#x624B;&#x5F00;&#x53D1;&#x3002;&#x6839;&#x636E;&#x8BBE;&#x8BA1;&#x7A3F;&#x642D;&#x51FA;&#x9875;&#x9762;&#xFF0C;&#x56E0;&#x4E3A;&#x9875;&#x9762;&#x5C11;&#xFF0C;&#x800C;&#x4E14;&#x90A3;&#x65F6;&#x5019;&#x4E5F;&#x6CA1;&#x6709;&#x7EC4;&#x4EF6;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5C31;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x7684;&#x642D;&#x5EFA;&#x3002;&#x6211;&#x4E60;&#x60EF;&#x5728;&#x642D;&#x9875;&#x9762;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x7528; <a href="https://nodejs.org/" target="_blank">node</a> &#x8D77;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#xFF0C; mock &#x4E00;&#x4E9B;&#x6570;&#x636E;&#xFF0C;&#x5982;&#x679C;&#x5F00;&#x53D1;&#x4E4B;&#x524D; API &#x63A5;&#x53E3;&#x7684;&#x683C;&#x5F0F;&#x5B9A;&#x4E49;&#x7684;&#x8FD8;&#x884C;&#xFF0C;&#x540E;&#x7EED;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x53EA;&#x9700;&#x7A0D;&#x5FAE;&#x6539;&#x52A8;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;</p>
<p>&#x4F46;&#x6211;&#x7406;&#x60F3;&#x4E2D;&#x7684;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#x6D41;&#x7A0B;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;&#x5148;&#x5199;&#x7EC4;&#x4EF6;&#xFF08;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x7684;&#x8BDD;&#xFF09;&#xFF0C;&#x5148;&#x51FA; html &#xFF0C;&#x8DDF; UI &#x7F8E;&#x5973;&#x786E;&#x8BA4;&#x65E0;&#x8BEF;&#x540E;&#xFF0C;&#x518D;&#x53BB;&#x505A;&#x4EA4;&#x4E92;&#xFF1B;&#x4EA4;&#x4E92;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x4EA4;&#x4ED8;&#x4EA7;&#x54C1;&#x786E;&#x8BA4;&#x6D41;&#x7A0B;&#x4E0A;&#x65E0;&#x8BEF;&#x540E;&#xFF0C;&#x518D;&#x4EA4;&#x4ED8; QA &#x6D4B;&#x8BD5;&#xFF0C;&#x6D4B;&#x8BD5;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x5927;&#x5BB6;&#x518D;&#x4E00;&#x8D77;&#x786E;&#x8BA4;&#x65E0;&#x8BEF;&#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4EA4;&#x4E8E;&#x8FD0;&#x7EF4;&#x51C6;&#x5907;&#x4E0A;&#x7EBF;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x626F;&#x5F97;&#x6709;&#x70B9;&#x8FDC;&#x4E86;&#xFF0C;&#x63A5;&#x7740;&#x8BF4;&#x8FD9;&#x4E2A;&#x5C0F;&#x7A0B;&#x5E8F;&#x3002;&#x6211;&#x63A5;&#x5230;&#x7684;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x662F;&#x4E00;&#x4E2A;&#x504F;&#x793E;&#x4EA4;&#x7684;&#x95EE;&#x5377;&#x7B54;&#x9898;&#x7684;&#x5C0F;&#x7A0B;&#x5E8F;&#x3002;</p>
<p><a href="https://zh.wikipedia.org/wiki/%E6%99%AE%E9%B2%81%E6%96%AF%E7%89%B9%E9%97%AE%E5%8D%B7" target="_blank">&#x666E;&#x9C81;&#x65AF;&#x7279;&#x95EE;&#x5377;</a>&#xFF0C;&#x5171;&#x6709; 28 &#x9053;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x7B54;&#x6848;&#x5E76;&#x4E0D;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#x9009;&#x9879;&#xFF0C;&#x800C;&#x662F;&#x5F00;&#x653E;&#x5F0F;&#x7684;&#x56DE;&#x7B54;&#x3002;&#x5728;&#x8FD9;&#x6B3E;&#x5C0F;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x53EA;&#x6709;&#x4E24;&#x6B21;&#x586B;&#x5199;&#x95EE;&#x5377;&#x7684;&#x673A;&#x4F1A;&#xFF08;&#x5B8C;&#x6574;&#x7248;&#x548C;&#x547D;&#x8FD0;&#x7248;&#x5404;&#x4E00;&#x6B21;&#x673A;&#x4F1A;&#xFF09;&#x3002;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7248;&#x672C;&#x662F;&#x8003;&#x8651;&#x5230;&#x8BA9;&#x7528;&#x6237;&#x586B;&#x5199;&#x6240;&#x6709;&#x7684;&#x95EE;&#x9898;&#x6709;&#x4E9B;&#x56F0;&#x96BE;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x662F;&#x591A;&#x79CD;&#x73A9;&#x6CD5;&#xFF0C;&#x589E;&#x52A0;&#x95EE;&#x5377;&#x7684;&#x8DA3;&#x5473;&#x6027;&#x3002;&#x7528;&#x6237;&#x7B54;&#x9898;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x5C55;&#x793A;&#x5230;&#x5E7F;&#x573A;&#xFF0C;&#x8BA9;&#x6BCF;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x90FD;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF1B;&#x4E5F;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x751F;&#x6210;&#x4E00;&#x5F20;&#x6D77;&#x62A5;&#x5206;&#x4EAB;&#x7ED9;&#x670B;&#x53CB;&#x6216;&#x53D1;&#x9001;&#x5230;&#x670B;&#x53CB;&#x5708;&#xFF0C;&#x6765;&#x9080;&#x8BF7;&#x66F4;&#x591A;&#x7684;&#x7528;&#x6237;&#x201C;&#x62F7;&#x95EE;&#x201D;&#x7075;&#x9B42;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x4F1A;&#x9080;&#x8BF7;&#x4E00;&#x4E9B;&#x540D;&#x5BB6;&#x6765;&#x586B;&#x5199;&#x95EE;&#x5377;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x6BCF;&#x4E2A;&#x9879;&#x76EE;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x957F;&#x671F;&#x7EF4;&#x62A4;&#x7684;&#x9700;&#x6C42;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x9996;&#x9875;&#x7684; banner &#x8981;&#x6362;&#xFF0C;&#x603B;&#x4E0D;&#x80FD;&#x518D;&#x53BB;&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#xFF0C;&#x91CD;&#x65B0;&#x90E8;&#x7F72;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8FD0;&#x7EF4;&#x7CFB;&#x7EDF;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FD0;&#x7EF4;&#x7CFB;&#x7EDF;&#x5C31;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#x4E86;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x505A;&#x7684;&#x5F88;&#x590D;&#x6742;&#x3002;&#x8FD9;&#x90FD;&#x53D6;&#x51B3;&#x4E8E;&#x9700;&#x6C42;&#x3002;&#x90A3;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x8FD0;&#x7EF4;&#xFF0C;&#x5C31;&#x53EA;&#x9700;&#x8981;&#x4FEE;&#x6539; banner &#x7684;&#x56FE;&#x7247;&#x8DF3;&#x8F6C;&#x94FE;&#x63A5;&#xFF1B;&#x7BA1;&#x7406;&#x7528;&#x6237;&#xFF0C;&#x5BF9;&#x6709;&#x975E;&#x6CD5;&#x7684;&#x7B54;&#x6848;&#x8FDB;&#x884C;&#x5C4F;&#x853D;&#xFF1B;&#x7BA1;&#x7406;&#x540D;&#x4EBA;&#xFF0C;&#x5411;&#x540D;&#x4EBA;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#x5B8C;&#x6210;&#x7B54;&#x6848;&#x7684;&#x5F55;&#x5165;&#x3002;
&#x5F00;&#x53D1;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x5728;&#x6625;&#x8282;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8BA9;&#x5927;&#x5BB6;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x62DC;&#x5E74;&#x65B9;&#x5F0F;&#xFF0C;<del>&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x5C06;&#x201C;&#x5403;&#x4E86;&#x4E48;&#x60A8;&#x201D;&#x6362;&#x4E3A;&#x201C;&#x666E;&#x9C81;&#x65AF;&#x7279;&#x95EE;&#x5377;&#x586B;&#x4E86;&#x4E48;&#x60A8;&#x201D;&#x5C31;&#x66F4;&#x597D;&#x4E86;</del>&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4E5F;&#x662F;&#x4E3A;&#x4E86;&#x8BA9;&#x66F4;&#x591A;&#x7684;&#x4EBA;&#x5173;&#x6CE8;&#x516C;&#x4F17;&#x53F7;&#xFF0C;&#x5173;&#x6CE8;&#x6587;&#x5B66;&#x4E4B;&#x7F8E;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4EFB;&#x52A1;&#x5C31;&#x6BD4;&#x8F83;&#x7D27;&#x6025;&#x4E86;&#x3002;&#x7559;&#x7ED9;&#x6211;&#x5F00;&#x53D1;&#x7684;&#x65F6;&#x95F4;&#x4E0D;&#x591A;&#x4E86;&#xFF0C;&#x80FD;&#x5426;&#x5728;&#x6700;&#x540E;&#x7684;&#x65F6;&#x95F4;&#x91CC;&#x4FDD;&#x6301;&#x9879;&#x76EE;&#x6CA1;&#x6709; bug &#x4E0A;&#x7EBF;&#xFF0C;&#x5C31;&#x663E;&#x5F97;&#x683C;&#x5916;&#x7684;&#x91CD;&#x8981;&#x3002;&#x4E0D;&#x8FC7;&#x60C5;&#x51B5;&#x4E5F;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x7CDF;&#xFF0C;&#x4E00;&#x5468;&#x9875;&#x9762;&#xFF0C;&#x4E00;&#x5468;&#x4EA4;&#x4E92;&#xFF0C;&#x4E00;&#x5468;&#x63A5;&#x53E3;&#x6D4B;&#x8BD5;&#xFF0C;&#x5C31;&#x641E;&#x5B9A;&#x3002;&#x6309;&#x7167;&#x8FD9;&#x4E2A;&#x8BA1;&#x5212;&#xFF0C;&#x8FD8;&#x4F1A;&#x5BCC;&#x88D5;&#x51FA;&#x4E24;&#x5468;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x505A;&#x7F13;&#x51B2;&#x3002;&#x4F46;&#x4E5F;&#x591A;&#x4E8F;&#x6709;&#x8FD9;&#x4E24;&#x5468;&#x7684;&#x7F13;&#x51B2;&#xFF0C;&#x624D;&#x80FD;&#x5728;&#x4E0A;&#x7EBF;&#x8282;&#x70B9;&#x4E0D;&#x63A8;&#x8FDF;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4FEE;&#x6539;&#x6216;&#x589E;&#x52A0;&#x90E8;&#x5206;&#x9700;&#x6C42;&#x4E0D;&#x5EF6;&#x671F;&#x3002;&#x53EF;&#x89C1;&#xFF0C;&#x9884;&#x4F30;&#x65F6;&#x95F4;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7ED9;&#x81EA;&#x5DF1;&#x591A;&#x4E00;&#x4E9B;&#x5197;&#x4F59;&#x65F6;&#x95F4;&#x662F;&#x591A;&#x4E48;&#x7684;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x5F53;&#x7136;&#x5728;&#x6625;&#x8282;&#x4E4B;&#x524D;&#x5B9A;&#x70B9;&#x4E0A;&#x7EBF;&#x3002;&#x8FD9;&#x91CC;&#x5FD8;&#x8BB0;&#x4E86;&#x8BF4;&#xFF0C;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x4E0A;&#x7EBF;&#x4E0D;&#x7528; web &#x7F51;&#x9875;&#x4F3C;&#x5F97;&#x89E3;&#x6790;&#x4E2A;&#x57DF;&#x540D;&#xFF0C;&#x90E8;&#x7F72;&#x5230;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x5C31; ok &#x3002;&#x5C0F;&#x7A0B;&#x5E8F;&#x867D;&#x7136;&#x4E0D;&#x7528;&#x670D;&#x52A1;&#x5668;&#xFF08;&#x672C;&#x6587;&#x90FD;&#x7AD9;&#x5728;&#x524D;&#x7AEF;&#x7684;&#x89D2;&#x5EA6;&#xFF0C;&#x4E0D;&#x6D89;&#x53CA;&#x540E;&#x7AEF;&#xFF09;&#xFF0C;&#x4F46;&#x4F7F;&#x7528;&#x522B;&#x4EBA;&#x7684;&#x4E1C;&#x897F;&#xFF08;&#x817E;&#x8BAF;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF09;&#xFF0C;&#x9700;&#x8981;&#x4E0A;&#x4F20;-&gt;&#x63D0;&#x4EA4;-&gt;&#x5BA1;&#x6838;&#x3002;&#x65E2;&#x7136;&#x6709;&#x5BA1;&#x6838;&#xFF0C;&#x5C31;&#x6709;&#x901A;&#x8FC7;&#x548C;&#x4E0D;&#x901A;&#x8FC7;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4E3A;&#x4E86;&#x4FDD;&#x969C;&#x5BA1;&#x6838;&#x7684;&#x901A;&#x8FC7;&#xFF0C;&#x4E00;&#x822C;&#x90FD;&#x4F1A;&#x91C7;&#x7528;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7684;&#x624B;&#x6CD5;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x505A;&#x4E00;&#x4E2A;&#x516C;&#x793A;&#x7C7B;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x5BA1;&#x6838;&#x65F6;&#x662F;&#x516C;&#x793A;&#x7C7B;&#x7684;&#x7EAF;&#x5C55;&#x793A;&#x7C7B;&#x9875;&#x9762;&#xFF1B;&#x5BA1;&#x6838;&#x901A;&#x8FC7;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x662F;&#x9879;&#x76EE;&#x7684;&#x771F;&#x5B9E;&#x9762;&#x76EE;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x8FD9;&#x5757;&#x7684;&#x7248;&#x672C;&#x53F7;&#x5C31;&#x663E;&#x5F97;&#x683C;&#x5916;&#x7684;&#x91CD;&#x8981;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x7684;&#x5B98;&#x65B9;&#x4EBA;&#x5458;&#x4E5F;&#x4F1A;&#x4E0D;&#x5B9A;&#x65F6;&#x7684;&#x76D1;&#x6D4B;&#x7684;&#xFF0C;&#x8FD9;&#x53EA;&#x662F;&#x786E;&#x4FDD;&#x51C6;&#x65F6;&#x4E0A;&#x7EBF;&#x4EA4;&#x5DE5;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x4EA4;&#x6076;&#x3002;<footer class="gitbook-plugin-qrcode-lists"><h2 id="&#x6253;&#x8D4F;&#x8054;&#x7CFB;">&#x6253;&#x8D4F;&amp;&#x8054;&#x7CFB;</h2><p>&#x5982;&#x679C;&#x60A8;&#x611F;&#x89C9;&#x6709;&#x6536;&#x83B7;&#xFF0C;&#x6B22;&#x8FCE;&#x7ED9;&#x6211;&#x6253;&#x8D4F;&#xFF0C;&#x4EE5;&#x6FC0;&#x52B1;&#x6211;&#x8F93;&#x51FA;&#x66F4;&#x591A;&#x7684;&#x4F18;&#x8D28;&#x5185;&#x5BB9;&#x3002;</p><div class="gitbook-plugin-qrcode-list"><img src="../../images/2038064998.png" alt="&#x652F;&#x4ED8;&#x5B9D;"><p>&#x652F;&#x4ED8;&#x5B9D;</p></div></footer></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            

        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"微信小程序","level":"1.2.1","depth":2,"next":{"title":"初识区块链","level":"1.2.2","depth":2,"path":"pages/2018/002.md","ref":"pages/2018/002.md","articles":[]},"previous":{"title":"2018","level":"1.2","depth":1,"ref":"","articles":[{"title":"微信小程序","level":"1.2.1","depth":2,"path":"pages/2018/001.md","ref":"pages/2018/001.md","articles":[]},{"title":"初识区块链","level":"1.2.2","depth":2,"path":"pages/2018/002.md","ref":"pages/2018/002.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["theme-api","chroma","qrcode-list","exercises","disqus"],"root":"","styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"disqus":{"useIdentifier":false,"shortName":"吴燮,"},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"theme-api":{"languages":[],"split":true,"theme":"dark"},"chroma":{},"exercises":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"qrcode-list":{"src":"''","alt":"''","only":"[]","text":"''","margin":"''","lists":[{"src":"/images/2038064998.png","content":"支付宝","alt":"支付宝"}],"title":"打赏&联系","content":"''","except":["自述"],"description":"如果您感觉有收获，欢迎给我打赏，以激励我输出更多的优质内容。"}},"theme":"default","author":"吴燮,","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"isbn":"","variables":{},"title":"记录","language":"zh","gitbook":">= 3.0.0","description":"记录我生活的那些人与事儿","direction":"ltr"},"file":{"path":"pages/2018/001.md","mtime":"2019-01-09T04:58:29.950Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-01-09T04:59:31.314Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook-plugin-exercises/jsrepl/jsrepl.js" id="jsrepl-script"></script>
    
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-exercises/ace/ace.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-exercises/ace/theme-tomorrow.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-exercises/ace/mode-javascript.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-exercises/exercises.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/URI.js/1.16.1/URI.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-disqus/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-theme-api/theme-api.js"></script>
        
    


    </body>
</html>

